of90/tutorials/rheoEFoam/channelEDF/PowerLaw/NernstPlanck/constant/electricProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      electricProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
parameters
{
        type             NernstPlanck;     
  
        relPerm          relPerm [ 0 0 0 0 0 0 0 ] 80.1;  
        T                T [ 0 0 0 1 0 0 0 ] 298;
        psiContrib       false;
        extraEField      extraEField [ 1 1 -3 0 0 -1  0 ] (5000 0 0);
        
        species
        (        
           ciCation
           {        
              z                 z [ 0 0 0 0 0 0 0 ] 1;      
              D                 D [ 0 2 -1 0 0 0 0 ] 1e-9;          
           }
           
           ciAnion
           {  
              z                 z [ 0 0 0 0 0 0 0 ] -1;         
              D                 D [ 0 2 -1 0 0 0 0 ] 1e-9;          
           }               
        ); 
}

// ************************************************************************* //
